# Time-stamp: <2020-05-05 10:35:19 PDT (mhb)>

* nvalt mode deft

need to look into configuring everything with use-package
(use-package deft
  :bind ("<f8>" . deft)
  :commands (deft)
  :config (setq deft-directory "~/Dropbox/notes"
                deft-extensions '("md" "org")))

deft directory is going to need configuration depending on operating system or
host

  #+begin_src emacs-lisp
  (use-package deft
    :ensure t
    :bind (:map deft-mode-map
           ("C-g" . deft-filter-clear)))
  (setq deft-default-extension "org")
  (setq deft-extensions '("org" "txt" "text" "md" "markdown"))

  (setq deft-text-mode 'org-mode)
  (setq deft-directory "~/sync/org-notes/")
  #+end_src

  #+RESULTS:
  : ~/sync/org-notes/

